test/pimpleFSIFoam_test/pimpleFSIFoam-obstacle/caseSetup/fluidDomain/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    interface
    {
        type zeroGradient;
    }
    outlet
    {
         type fixedValue;
         value uniform 0;
    }
    inlet
    {
        type zeroGradient;
    }
    bottom
    {
        type zeroGradient;
    }
    top
    {
        type zeroGradient;
    }
    left
    {
        type zeroGradient;
    }
    symmetry
    {
        type symmetryPlane;
    }
}


// ************************************************************************* //
