test/pimpleFSIFoam_test/pimpleFSIFoam-obstacle/caseSetup/fluidDomain/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application       pimpleFSIFoam;
startFrom         latestTime;
startTime         0.;
stopAt            endTime;
endTime           10;
deltaT            0.1; 
writeControl      timeStep;
writeInterval     1;
purgeWrite        0;
writeFormat       binary;
writePrecision    18;
writeCompression  compressed;
timeFormat        general;
timePrecision     18;
graphFormat       gnuplot;
runTimeModifiable yes;
adjustTimeStep    no;
maxCo             0.2;
maxDeltaT         1.0E-00;
libs
(

);

//###########################################################################//

functions 
{
  
    beamForces
    {
        type                forces;
        libs                ("libforces.so");
        enabled             true;
        writeControl        timeStep;
        writeInterval       1;
        timeStart           0.;
        timeEnd             1.E+10;
     
        patches             ( "interface" );
        directForceDensity  no;
        p                   p;
        U                   U;
        rho                 rhoInf;
        log                 true;           // Dump to file

        CofR                (0. 0. 0.);

        rhoInf              1000;
    }

    beamForceCoeffs
    {
        type                forceCoeffs;
        libs                ( "libforces.so" );
        enabled             true;
        writeControl        timeStep;
        writeInterval       1;
        timeStart           0.;
        timeEnd             1.E+10;
 
        patches             ( "interface" );
        directForceDensity  no;
        p                   p;
        U                   U;
        rho                 rhoInf;
        log                 true;

        liftDir             (0. 1. 0.);
        dragDir             (1. 0. 0.);
        CofR                (0. 0. 0.);
        pitchAxis           (0. 0. 1.);

        magUInf             0.3;
        rhoInf              1000;
        lRef                1.0;
        Aref                1.0;
    }
}

// ************************************************************************* //
